УНФ_ТЕСТ/src/Catalogs/ЭквайринговыеТерминалы/ЭквайринговыеТерминалы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭквайринговыеТерминалы</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Касса</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезПодключенияОборудования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Эквайрер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетЭквайринг</name>
    <comment>Банковский счет для эквайринговых операций</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭквайрерБеретКомиссиюЗаВозвратДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияЗаВозвратУменьшаетКомиссиюЗаОплату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>УчитыватьВНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Патент</name>
    <type>
      <types>CatalogRef.Патенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СобственныеНастройкиНалоговогоУчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДляКредита</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыПлатежныхКарт</name>
    <attributes>
      <name>ВидПлатежнойКарты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентКомиссии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/ЭквайринговыеТерминалы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция определяет организацию, кассу и валюту выбранного эквайрингового терминала.
//
// Параметры:
//  ЭквайринговыйТерминал - СправочникСсылка.ЭквайринговыеТерминалы - Ссылка на эквайринговый терминал
//
// Возвращаемое значение:
//	Структура - Организация, Касса и Валюта эквайрингового терминала
//
Функция ПолучитьРеквизитыЭквайринговогоТерминала(ЭквайринговыйТерминал) Экспорт
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЭквайринговыеТерминалы.Организация КАК Организация,
	|	ЭквайринговыеТерминалы.Касса КАК Касса
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	ЭквайринговыеТерминалы.Ссылка = &ЭквайринговыйТерминал
	|");
	
	Запрос.УстановитьПараметр("ЭквайринговыйТерминал", ЭквайринговыйТерминал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Организация = Выборка.Организация;
		Касса = Выборка.Касса;
	Иначе
		Организация = Неопределено;
		Касса = Неопределено;
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура("Организация, Касса",
		Организация,
		Касса
	);
	
	Возврат СтруктураРеквизитов;
	
КонецФункции // ПолучитьРеквизитыЭквайринговогоТерминала()

// Функция определяет эквайринговый терминал по выбранной кассе.
//
// Возвращает эквайринговый терминал, если найден один эквайринговый терминал.
// Возвращает Неопределено, если эквайринговый терминал не найден или эквайринговых терминалов больше одного.
//
// Параметры:
//  Организация - СправочникСсылка.Кассы (СправочникСсылка.КассыККМ) - Ссылка на кассу
//
// Возвращаемое значение:
//	СправочникСсылка.ЭквайринговыеТерминалы - Найденный эквайринговый терминал
//
Функция ПолучитьЭквайринговыйТерминалПоУмолчанию(Касса) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ЭквайринговыеТерминалы.Ссылка КАК ЭквайринговыйТерминал
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	ЭквайринговыеТерминалы.Касса = &Касса
	|	И НЕ ЭквайринговыеТерминалы.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 
	   И Выборка.Следующий()
	Тогда
		ЭквайринговыйТерминал = Выборка.ЭквайринговыйТерминал;
	Иначе
		ЭквайринговыйТерминал = Неопределено;
	КонецЕсли;
	
	Возврат ЭквайринговыйТерминал;

КонецФункции // ПолучитьЭквайринговыйТерминалПоУмолчанию()

// Функция определяет эквайринговый терминал по выбранной кассе.
//
// Возвращает эквайринговый терминал, если найден один эквайринговый терминал.
// Возвращает Неопределено, если эквайринговый терминал не найден или эквайринговых терминалов больше одного.
//
// Параметры:
//  Организация - СправочникСсылка.Кассы (СправочникСсылка.КассыККМ) - Ссылка на кассу
//
// Возвращаемое значение:
//	СправочникСсылка.ЭквайринговыеТерминалы - Найденный эквайринговый терминал
//
Функция ПолучитьЭквайринговыйТерминалПоУмолчаниюДляОперацииЭквайринга(БанковскийСчет, Организация, Эквайрер = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ЭквайринговыеТерминалы.Ссылка КАК ЭквайринговыйТерминал
	|ИЗ
	|	Справочник.ЭквайринговыеТерминалы КАК ЭквайринговыеТерминалы
	|ГДЕ
	|	НЕ ЭквайринговыеТерминалы.ПометкаУдаления
	|	И (&БанковскийСчетЭквайринг = ЗНАЧЕНИЕ(Справочник.БанковскиеСчета.ПустаяСсылка)
	|			ИЛИ ЭквайринговыеТерминалы.БанковскийСчетЭквайринг = &БанковскийСчетЭквайринг)
	|	И (&Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ИЛИ ЭквайринговыеТерминалы.Организация = &Организация)
	|	И (&Эквайрер = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ИЛИ &Эквайрер = НЕОПРЕДЕЛЕНО
	|			ИЛИ ЭквайринговыеТерминалы.Эквайрер = &Эквайрер)");
	
	Запрос.УстановитьПараметр("БанковскийСчетЭквайринг", БанковскийСчет);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Эквайрер", Эквайрер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() = 1 
	   И Выборка.Следующий()
	Тогда
		ЭквайринговыйТерминал = Выборка.ЭквайринговыйТерминал;
	Иначе
		ЭквайринговыйТерминал = Неопределено;
	КонецЕсли;
	
	Возврат ЭквайринговыйТерминал;

КонецФункции // ПолучитьЭквайринговыйТерминалПоУмолчанию()

// Процедура получения списка видов платежных карт, обслуживаемых по договору эквайринга
//
// Параметры:
//  ЭквайринговыйТерминал - СправочникСсылка.ЭквайринговыеТерминалы - Ссылка на эквайринговый терминал
//
// Возвращое значение:
//	Массив - Массив видов платежных карт
//
Функция ВидыПлатежныхКарт(ЭквайринговыйТерминал) Экспорт
	
	МассивВидовПлатежныхКарт = Новый Массив;
	
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыПлатежныхКарт.ВидПлатежнойКарты КАК ВидПлатежнойКарты
		|ИЗ
		|	Справочник.ЭквайринговыеТерминалы.ВидыПлатежныхКарт КАК ВидыПлатежныхКарт
		|ГДЕ
		|	ВидыПлатежныхКарт.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ЭквайринговыйТерминал);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивВидовПлатежныхКарт.Добавить(Выборка.ВидПлатежнойКарты);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивВидовПлатежныхКарт;
	
КонецФункции // ВидыПлатежныхКарт()

// Процедура получения списка видов платежных карт, обслуживаемых по договору эквайринга
//
// Параметры:
//  ЭквайринговыйТерминал - СправочникСсылка.ЭквайринговыеТерминалы - Ссылка на эквайринговый терминал
//
// Возвращое значение:
//	Массив - Массив видов платежных карт
//
Функция ВидыПлатежныхКартИПроцентыКомиссии(ЭквайринговыйТерминал) Экспорт
	
	ТаблицаВидовПлатежныхКартИПроцентовКомиссии = Новый ТаблицаЗначений;
	
	Если ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыПлатежныхКарт.ВидПлатежнойКарты КАК ВидПлатежнойКарты,
		|	ВидыПлатежныхКарт.ПроцентКомиссии
		|ИЗ
		|	Справочник.ЭквайринговыеТерминалы.ВидыПлатежныхКарт КАК ВидыПлатежныхКарт
		|ГДЕ
		|	ВидыПлатежныхКарт.Ссылка = &Ссылка");
		
		Запрос.УстановитьПараметр("Ссылка", ЭквайринговыйТерминал);
		
		ТаблицаВидовПлатежныхКартИПроцентовКомиссии = Запрос.Выполнить().Выгрузить();
		
	КонецЕсли;
	
	Возврат ТаблицаВидовПлатежныхКартИПроцентовКомиссии;
	
КонецФункции // ВидыПлатежныхКарт()

Процедура ПометитьНаУдалениеТерминалыСДоговором(Договор) Экспорт
	
	НачатьТранзакцию();
	
	МассивТерминалов = ЭквайринговыеОперацииСервер.ПолучитьТерминалыПоДоговору(Договор);
	Для Каждого Терминал Из МассивТерминалов Цикл
		Если Не Терминал.ПометкаУдаления Тогда
			ТерминалОбъект = Терминал.ПолучитьОбъект();
			ТерминалОбъект.УстановитьПометкуУдаления(Истина);
		КонецЕсли;
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И( ЗначениеРазрешено(Касса)
	|	ИЛИ ЗначениеРазрешено(Касса)
	|	)И ЗначениеРазрешено(БанковскийСчетЭквайринг)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
